var classes     = [
		'22後',
		'23前',
		'23後',
		'24前',
		'24後',
		'25前',
		'25後',
		'26前',
		'26後',
		'27前',
		'27後',
		'28前',
		'28後',
		'29前',
		'29後',
		'30前',
		'30後',
		'31前',
		'31後',
		'32前',
		'32後',
		'33前',
		'33後',
		'34前',
		'34後',
		'35前',
		'35後',
		'36前',
		'36後'
	]


var trace1 = {
	x: classes,
	y: [
		null, // 22後
		null, // 23前
		null, // 23後
		null, // 24前
		null, // 24後
		null, // 25前
		null, // 25後
		null, // 26前
		null, // 26後
		null, // 27前
		null, // 27後
		null, // 28前
		null, // 28後
		null, // 29前
		9,    // 29後
		15,   // 30前
		18,   // 30後
		null, // 31前 成績表なし
		null, // 31後 成績表なし
		24,   // 32前
		21,   // 32後
		21,   // 33前
		17,   // 33後
		17,   // 34前
		15,   // 34後
		13,   // 35前
		17,   // 35後
		25,   // 36前
		27    // 36後
	],
	name: 'Eリーグ',
	type: 'bar',
	marker: {color: 'rgb(204,204,204)'}
}
	
var trace2 = {
	x: classes,
	y: [
		null, // 22後
		null, // 23前
		null, // 23後
		null, // 24前
		null, // 24後
		null, // 25前
		null, // 25後
		30,   // 26前
		29,   // 26後
		52,   // 27前
		44,   // 27後
		40,   // 28前
		34,   // 28後
		49,   // 29前
		51,   // 29後
		59,   // 30前
		56,   // 30後
		51,   // 31前
		52,   // 31後
		47,   // 32前
		53,   // 32後
		57,   // 33前
		59,   // 33後
		62,   // 34前
		57,   // 34後
		50,   // 35前
		44,   // 35後
		55,   // 36前
		58    // 36後
	],
	name: 'D3リーグ',
	type: 'bar',
	marker: {color: 'rgb(204,204,255)'}
}

var trace3 = {
	x: classes,
	y: [
		null, // 22後
		56,   // 23前
		38,   // 23後
		70,   // 24前
		55,   // 24後
		76,   // 25前
		63,   // 25後
		41,   // 26前
		36,   // 26後
		33,   // 27前
		39,   // 27後
		40,   // 28前
		41,   // 28後
		35,   // 29前
		37,   // 29後
		39,   // 30前
		42,   // 30後
		44,   // 31前
		41,   // 31後
		39,   // 32前
		39,   // 32後
		42,   // 33前
		40,   // 33後
		38,   // 34前
		37,   // 34後
		41,   // 35前
		44,   // 35後
		43,   // 36前
		47    // 36後
	],
	name: 'D2リーグ',
	type: 'bar',
	marker: {color: 'rgb(204,221,255)'}
}

var trace4 = {
	x: classes,
	y: [
		58,   // 22後
		47,   // 23前
		35,   // 23後
		36,   // 24前
		44,   // 24後
		43,   // 25前
		41,   // 25後
		44,   // 26前
		43,   // 26後
		39,   // 27前
		44,   // 27後
		43,   // 28前
		38,   // 28後
		39,   // 29前
		37,   // 29後
		40,   // 30前
		40,   // 30後
		35,   // 31前
		36,   // 31後
		33,   // 32前
		33,   // 32後
		32,   // 33前
		34,   // 33後
		32,   // 34前
		36,   // 34後
		40,   // 35前
		43,   // 35後
		45,   // 36前
		46    // 36後
	],
	name: 'D1リーグ',
	type: 'bar',
	marker: {color: 'rgb(204,238,255)'}
}

var trace5 = {
	x: classes,
	y: [
		32,   // 22後
		36,   // 23前
		29,   // 23後
		32,   // 24前
		32,   // 24後
		37,   // 25前
		40,   // 25後
		37,   // 26前
		35,   // 26後
		40,   // 27前
		41,   // 27後
		40,   // 28前
		39,   // 28後
		39,   // 29前
		40,   // 29後
		36,   // 30前
		34,   // 30後
		36,   // 31前
		34,   // 31後
		35,   // 32前
		32,   // 32後
		36,   // 33前
		36,   // 33後
		40,   // 34前
		44,   // 34後
		47,   // 35前
		44,   // 35後
		43,   // 36前
		46    // 36後
	],
	name: 'C3リーグ',
	type: 'bar',
	marker: {color: 'rgb(204,255,255)'}
}

var trace6 = {
	x: classes,
	y: [
		32,   // 22後
		32,   // 23前
		30,   // 23後
		32,   // 24前
		30,   // 24後
		33,   // 25前
		32,   // 25後
		35,   // 26前
		34,   // 26後
		36,   // 27前
		36,   // 27後
		35,   // 28前
		37,   // 28後
		40,   // 29前
		40,   // 29後
		36,   // 30前
		39,   // 30後
		42,   // 31前
		39,   // 31後
		38,   // 32前
		41,   // 32後
		36,   // 33前
		36,   // 33後
		40,   // 34前
		39,   // 34後
		45,   // 35前
		43,   // 35後
		47,   // 36前
		47    // 36後
	],
	name: 'C2リーグ',
	type: 'bar',
	marker: {color: 'rgb(221,255,238)'}
}

var trace7 = {
	x: classes,
	y: [
		30,   // 22後
		32,   // 23前
		28,   // 23後
		28,   // 24前
		30,   // 24後
		31,   // 25前
		32,   // 25後
		36,   // 26前
		36,   // 26後
		34,   // 27前
		33,   // 27後
		36,   // 28前
		37,   // 28後
		36,   // 29前
		35,   // 29後
		35,   // 30前
		35,   // 30後
		33,   // 31前
		31,   // 31後
		32,   // 32前
		33,   // 32後
		32,   // 33前
		32,   // 33後
		32,   // 34前
		31,   // 34後
		31,   // 35前
		32,   // 35後
		33,   // 36前
		29    // 36後
	],
	name: 'C1リーグ',
	type: 'bar',
	marker: {color: 'rgb(238,255,221)'}
}

var trace8 = {
	x: classes,
	y: [
		16,   // 22後
		16,   // 23前
		15,   // 23後
		16,   // 24前
		15,   // 24後
		16,   // 25前
		16,   // 25後
		16,   // 26前
		17,   // 26後
		17,   // 27前
		15,   // 27後
		16,   // 28前
		16,   // 28後
		15,   // 29前
		16,   // 29後
		16,   // 30前
		15,   // 30後
		16,   // 31前
		16,   // 31後
		17,   // 32前
		16,   // 32後
		17,   // 33前
		16,   // 33後
		17,   // 34前
		16,   // 34後
		17,   // 35前
		16,   // 35後
		16,   // 36前
		16    // 36後
	],
	name: 'B2リーグ',
	type: 'bar',
	marker: {color: 'rgb(255,255,204)'}
}

var trace9 = {
	x: classes,
	y: [
		16,   // 22後
		16,   // 23前
		14,   // 23後
		16,   // 24前
		16,   // 24後
		16,   // 25前
		15,   // 25後
		16,   // 26前
		16,   // 26後
		15,   // 27前
		16,   // 27後
		15,   // 28前
		16,   // 28後
		16,   // 29前
		16,   // 29後
		16,   // 30前
		16,   // 30後
		16,   // 31前
		16,   // 31後
		16,   // 32前
		16,   // 32後
		16,   // 33前
		16,   // 33後
		16,   // 34前
		16,   // 34後
		16,   // 35前
		16,   // 35後
		16,   // 36前
		16    // 36後
	],
	name: 'B1リーグ',
	type: 'bar',
	marker: {color: 'rgb(255,238,204)'}
}

var trace10 = {
	x: classes,
	y: [
		16,   // 22後
		13,   // 23前
		13,   // 23後
		15,   // 24前
		15,   // 24後
		16,   // 25前
		16,   // 25後
		16,   // 26前
		16,   // 26後
		15,   // 27前
		15,   // 27後
		16,   // 28前
		16,   // 28後
		16,   // 29前
		16,   // 29後
		13,   // 30前
		13,   // 30後
		16,   // 31前
		16,   // 31後
		16,   // 32前
		16,   // 32後
		16,   // 33前
		16,   // 33後
		16,   // 34前
		16,   // 34後
		16,   // 35前
		16,   // 35後
		16,   // 36前
		16    // 36後
	],
	name: 'A2リーグ',
	type: 'bar',
	marker: {color: 'rgb(255,221,204)'}
}

var trace11 = {
	x: classes,
	y: [
		12,   // 22後
		8,    // 23前
		8,    // 23後
		10,   // 24前
		10,   // 24後
		12,   // 25前
		12,   // 25後
		12,   // 26前
		12,   // 26後
		12,   // 27前
		12,   // 27後
		11,   // 28前
		11,   // 28後
		12,   // 29前
		12,   // 29後
		12,   // 30前
		12,   // 30後
		12,   // 31前
		12,   // 31後
		12,   // 32前
		12,   // 32後
		12,   // 33前
		12,   // 33後
		12,   // 34前
		12,   // 34後
		12,   // 35前
		12,   // 35後
		12,   // 36前
		12    // 36後
	],
	name: 'A1リーグ',
	type: 'bar',
	marker: {color: 'rgb(255,204,204)'}
}

var JunNishikawa = {
	x: classes,
	y: [
		138,  // 22後
		178,  // 23前
		136,  // 23後
		185,  // 24前
		164,  // 24後
		218,  // 25前
		215,  // 25後
		223,  // 26前
		207,  // 26後
		226,  // 27前
		217,  // 27後
		224,  // 28前
		222,  // 28後
		250,  // 29前
		277,  // 29後
		285,  // 30前
		292,  // 30後
		264,  // 31前
		255,  // 31後
		280,  // 32前
		null, // 32後
		null, // 33前
		288,  // 33後
		292,  // 34前
		null, // 34後
		null, // 35前
		314,  // 35後
		null, // 36前
		358   // 36後
	],
	name: '西川淳',
	type: 'scatter',
	connectgaps: true,
	marker: {color: 'rgb(0,153,0)'}

}

var RyoeiHirano = {
	x: classes,
	y: [
		null, // 22後
		null, // 23前
		null, // 23後
		null, // 24前
		null, // 24後
		null, // 25前
		null, // 25後
		null, // 26前
		null, // 26後
		null, // 27前
		null, // 27後
		null, // 28前
		null, // 28後
		null, // 29前
		null, // 29後
		null, // 30前
		null, // 30後
		null, // 31前
		7,    // 31後
		53,   // 32前
		67,   // 32後
		94,   // 33前
		111,  // 33後
		137,  // 34前
		205,  // 34後
		198,  // 35前
		233,  // 35後
		276,  // 36前
		null  // 36後
	],
	name: '平野良栄',
	type: 'scatter',
	connectgaps: true,
	marker: {color: 'rgb(204,0,0)'}
}

var TakehiroIshidate = {
	x: classes,
	y: [
		null, // 22後
		null, // 23前
		null, // 23後
		67,   // 24前
		63,   // 24後
		100,  // 25前
		88,   // 25後
		98,   // 26前
		66,   // 26後
		103,  // 27前
		106,  // 27後
		100,  // 28前
		75,   // 28後 休場扱い→D1最下位
		59,   // 29前
		93,   // 29後
		124,  // 30前
		123,  // 30後
		119,  // 31前
		120,  // 31後
		136,  // 32前
		142,  // 32後
		186,  // 33前
		209,  // 33後
		226,  // 34前
		252,  // 34後
		266,  // 35前
		270,  // 35後
		265,  // 36前
		281   // 36後
	],
	name: '石立岳大',
	type: 'scatter',
	connectgaps: true,
	marker: {color: 'rgb(0,0,204)'}
}

var data = [
	trace1,trace2,trace3,trace4,trace5,trace6,trace7,trace8,trace9,trace10,trace11,
	JunNishikawa,RyoeiHirano,TakehiroIshidate
]
	
var layout = {
	title: 'リーグ戦（22期後期～36期後期）',
	barmode: 'stack',
	height: 700
}

var config = {
	displayModeBar: false,
	responsive: true,
	scrollZoom: true
}

Plotly.newPlot('myDiv', data, layout, config)
